-- phpMyAdmin SQL Dump
-- version 3.2.3
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: May 31, 2024 at 04:15 PM
-- Server version: 5.1.40
-- PHP Version: 5.2.12

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `TORI`
--

-- --------------------------------------------------------

--
-- Table structure for table `employees`
--

CREATE TABLE IF NOT EXISTS `employees` (
  `id` int(11) NOT NULL,
  `login` varchar(100) NOT NULL,
  `passwd` varchar(100) NOT NULL,
  `firstname` varchar(200) NOT NULL,
  `lastname` varchar(200) NOT NULL,
  `surname` varchar(200) NOT NULL,
  `room` varchar(100) NOT NULL,
  `post` varchar(100) NOT NULL,
  `state` int(11) NOT NULL DEFAULT '1',
  `rate` int(11) NOT NULL DEFAULT '40',
  `defaultStartTime` time NOT NULL DEFAULT '10:00:00',
  `allowedDelayMinutes` int(11) NOT NULL DEFAULT '30',
  `userTimeZoneMins` int(11) NOT NULL DEFAULT '420',
  `dayTransitionTime` time NOT NULL DEFAULT '00:00:00',
  `remoteWork` int(11) NOT NULL DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `employees`
--

INSERT INTO `employees` (`id`, `login`, `passwd`, `firstname`, `lastname`, `surname`, `room`, `post`, `state`, `rate`, `defaultStartTime`, `allowedDelayMinutes`, `userTimeZoneMins`, `dayTransitionTime`, `remoteWork`) VALUES
(2, 'braun', '8cf0371f9febc12578547ec49af6a8d3', 'Андрей', 'Владимирович', 'Браун', '', '', 1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(1, 'Vvs', '4d21850c54f07fdf6228c5f36f79f783', 'Владимир', 'Викторович', 'Супрунчик', '', '', 1, 40, '10:00:00', 30, 420, '04:00:00', 1),
(3, 'paul', '06a888de32bee52b387378ec13349ce5', 'Павел', 'Павлович', 'Маслов', '', '', 1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(19, 'sergei', 'e3c7f634d4438cd5c927b38c1a423f34', 'Сергей', 'Сергеевич', 'Иванов', '', '', -1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(18, 'anisenev', '6152f3a3a767ecd92346ac13e03cedf4', 'Алексей', 'Александрович', 'Анисенев', '', '', 1, 40, '10:00:00', 30, 420, '03:00:00', 0),
(16, 'Icegar', '6b983cfcb7e5c8edb47bdb02f3b46b07', 'Константин', 'Викторович', 'Супрунчик', '', '', 1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(5, 'Ivan', '93bbc2169fba087f4b7bae636654208a', 'Иван', 'Иванович', 'Заворин', '', '', -1, 40, '09:00:00', 30, 420, '00:00:00', 0),
(23, 'savelev', '1f32aa4c9a1d2ea010adcf2348166a04', 'Максим', 'Викторович', 'Савельев', '', '', -1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(500, 'dirSVV', '723c336bcec88f9bb0fcb52c9b2ec792', 'Директор', '', '', '', '', 1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(30, 'melnichuk', '9e13125f8518f67094a7b3493395d189', 'Иван', 'Николаевич', 'Мельничук', '556', '1', 1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(40, 'supr-pupr', 'cd166b2061411a6a1f4e27330891e7cb', 'Виктория', 'Алексеевна', 'Супрунчик', '556', '', 1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(31, 'alekshmakov', '8d18b124ed7d5b29643f2e16b9c3778e', 'Алексей', 'Александрович', 'Шмаков', '501', '', 1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(501, 'dirSNA', 'cc1fdeb1cc72e5bff3e0739d599d81a0', 'Надежда', 'Алексеевна', 'Супрунчик', '556', '', 1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(50, 'tsoy', '1f32aa4c9a1d2ea010adcf2348166a04', 'Марина', 'Леонидовна', 'Цой', '501', '', 1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(101, 'Cvetkov', '1829fcd499ff2ef8fd7ef87097e9b2a9', 'Александр', 'Владимирович', 'Цветков', '0', '', 1, 40, '10:30:00', 30, 300, '00:00:00', 0),
(25, 'Vlasov', '4309f1d8e9c44fbacf82c5d4c21f9ef8', 'Александр', 'Юрьевич', 'Власов', '562', '', 1, 40, '09:00:00', 30, 420, '00:00:00', 0),
(146, 'ryabov', '2e8abcd800259468e28f06bd95fcd4c3', 'Игорь', 'Юрьевич', 'Рябов', '', '', 1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(151, 'bugai', '08f7aa65887432f59f09122f2ed96f2b', 'Дмитрий', 'Алексеевич', 'Бугай', '', '', 1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(111, 'smalugin', '0326975ac016674f88e4f8697668ebb4', 'Сергей', 'Сергеевич', 'Малюгин', '501', '', 1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(112, 'alekshaev', '0ff1f15ad7ab8938259741fce53cbb5c', 'Алексей', 'Алексеевич', 'Алекшаев', '501', '', 1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(120, 'murtazin', '1f32aa4c9a1d2ea010adcf2348166a04', 'Андрей', 'Дамирович', 'Муртазин', '0', '', 1, 40, '10:30:00', 30, 300, '00:00:00', 0),
(145, 'orlik', '4873c443eb83fd925a2099d30038135f', 'Евгений', 'Владимирович', 'Орлик', '', '', 1, 40, '09:00:00', 30, 420, '00:00:00', 0),
(152, 'vovchenko', '2a81d1f4e3221e5972dbac574e9e4346', 'Антон', 'Сергеевич', 'Вовченко', '0', '', 1, 40, '08:30:00', 30, 300, '00:00:00', 0),
(121, 'krynin', '707946bac36ea380b75a5c2fa7805a85', 'Игорь', 'Сергеевич', 'Крынин', '501', '', 1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(125, 'TVP', '9983052d30cd1ad9d299d8c8fdc07220', 'Татьяна', 'Валерьевна', 'Панькина', '556', '', 1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(111111, 'tori', '6483b64f9c00d60d3fbeb2c1004fc385', 'Tori', '', '', '', '', 1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(160, 'kobzar', '304e31403b0af47260a5da18954aa806', 'Наталья', 'Сергеевна', 'Кобзарь', '', '', 1, 40, '09:00:00', 30, 420, '00:00:00', 0),
(148, 'melnichenko', '21982ba34f18751710467facb368254e', 'Юлия', 'Юрьевна', 'Мельниченко', '', '', 1, 40, '09:00:00', 30, 420, '00:00:00', 0),
(150, 'zhdanov', 'aea7e769a127a3415e33aafff2d6b8ee', 'Дмитрий', 'Александрович', 'Жданов', '20', '', 1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(153, 'ivanov.i', '04d89d6e0b1ded11024c475a45f5f65d', 'Иван', 'Владимирович', 'Иванов', '201', '', 1, 40, '10:00:00', 30, 420, '00:00:00', 0),
(555, 'test', 'fb469d7ef430b0baf0cab6c436e70375', 'Гандон', '', 'Штопаный', '', '', 1, 40, '10:00:00', 30, 0, '10:32:00', 0);
